## Creating a MySQL Database 
Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

Create a new database on your MySQL server and call it "movies".

Make sure to have the following tables in your "movies" database:

* title_basics
* title_ratings
* title_genres
* genres
* tmdb_data

In [71]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection and create database for mysql named movies
connection = "mysql+pymysql://root:root@localhost/movies"

In [72]:
#Create engine
engine = create_engine(connection)
database_exists(connection)

False

In [141]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [142]:
#Load in basics
df = pd.read_csv('/Data Enrichment/Week 1/Project 3/basics.csv.gz')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

## Normalizing Genres - Overview

In [143]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
83789,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
83790,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
83791,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
83792,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
83793,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

### Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

* tconst
* genre_id
2. genres:

* genre_id
* genre_name

In [144]:
#Instantiate exploded genres and sxplode genres split
exploded_genres = df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
83792,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
83792,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
83792,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
83793,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
83793,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [145]:
#Apply unique and sort exploded genres
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [146]:
#Instantiate title genres as new table
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [147]:
#Convert title genres to sql table
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

156563

In [148]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [149]:
## make new integer genre_id and drop string genres
df['genre_id'] = df['genres_split'].replace(genre_map)
df = df.drop(columns='genres_split')

In [150]:
#Instantiate new genre table
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [151]:
#Convert genres to sql table
genre_lookup.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

26

### For the title basics table, drop the following columns:
* "original_title" (we will use the primary title column instead)
* "isAdult" ("Adult" will show up in the genres so this is redundant information).
* "titleType" (every row will be a movie).
* "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [153]:
#Drop unecessary columns
title_basics = df.drop(columns=['originalTitle', 'isAdult', 'titleType',
                      'genres', 'endYear', 'genre_id'])
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [154]:
#Convert title basics to sql table
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

83794

### Create Table for Title Ratings
* Movie ID (tconst)
* Average Movie Rating
* Number of Votes

In [155]:
#Load in ratings
ratings = pd.read_csv('/Data Enrichment/Week 1/Project 3/ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1922
1  tt0000002            5.8       259
2  tt0000003            6.5      1736
3  tt0000004            5.6       174
4  tt0000005            6.2      2549

In [156]:
#Convert ratings to sql table
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

1248043

### Create Table for The TMDB API Results (multiple files)
* Movie ID
* Revenue
* Budget
* Certification (MPAA Rating)

In [157]:
#Load in tmdb data
tmdb = pd.read_csv('final_tmdb_data_{YEAR}.csv.gz')
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.327,1159.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.600,118.0,PG-13
4,tt0118652,0.0,/mWxJEFRMvkG4UItYJkRDMgWQ08Y.jpg,NaN,1000000.0,"[{'id': 27, 'name': 'Horror'}, {'id': 9648, 'n...",NaN,17140.0,en,The Attic Expeditions,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,His search for peace of mind... will leave his...,The Attic Expeditions,0.0,5.100,28.0,R

In [158]:
#Keep only whats needed for table
tmdb = tmdb[['imdb_id','revenue','budget','certification']]
tmdb.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0035423  76019048.0  48000000.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0118589   5271666.0  22000000.0         PG-13
4  tt0118652         0.0   1000000.0             R

Noticed NaN values and unwanted rows, so we will take care of it.

In [159]:
#Check the missing values
tmdb.isna().sum()

imdb_id            0
revenue            1
budget             1
certification    874
dtype: int64

In [160]:
#Drop missing values
tmdb = tmdb.dropna()
tmdb.head()

     imdb_id     revenue      budget certification
1  tt0035423  76019048.0  48000000.0         PG-13
3  tt0118589   5271666.0  22000000.0         PG-13
4  tt0118652         0.0   1000000.0             R
6  tt0120166         0.0         0.0            NR
8  tt0120681  74558115.0  35000000.0             R

Looks good now.

In [161]:
#Convert tmsb data to a sql table
tmdb.to_sql('tmdb_data', engine, index=False, if_exists = 'replace')

421

In [162]:
#Display tables to make sure we have everything
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

All the requested tables are now inside a movies sql database.

In [163]:
#Create length for keys
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [164]:
#Make title basics as primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')